web/app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.all
---
SELECT `contacts`.* FROM `contacts`

  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO `contacts` (`name`, `surname`, `email`, `message`, `created_at`, `updated_at`) VALUES ('astm', 'ali', 'ccc@ccc.ccc', 'hello', '2015-12-23 12:47:55', '2015-12-23 12:47:55')

    def set_contact
      @contact = Contact.find(params[:id])
---
SELECT  `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 1 LIMIT 1